import Joi from "joi";

//35. створюємо джой обєкт, в якому прописуємо обєкти які будемо валідувати
const carValidator = Joi.object({
    model: Joi.string().regex(/^[a-zA-ZА-яёЁіІїЇґҐєЄ]{1,20}$/).required().messages({//36. для поля модел буде: стрінгове, ругулярним виразом прописуємо /^ - початок регулярного виразу, [a-zA-ZА-яёЁіІїЇґҐєЄ] те що можна вводити, {1,20}-к-ть символів, required() - обов'язкове поле
        'string.pattern.base': 'Тільки букви, мінімум 1 символ, максимум 20'//37. текст, при помилці вводу
    }),
    price: Joi.number().min(0).max(1000000).required(), //38. для поля прайс буде: Joi.number() - число, мінімально 0, максимум мільйон required() - обов'язкове поле
    year: Joi.number().min(1990).max(new Date().getFullYear()).required() //39. для поля дата: Joi.number() - число, мінімально - 1990 рік, максимально поточний рік required() - обов'язкове поле
});

export {
    carValidator
}